"""
ЗАДАНИЕ
--------------------------------------------------------------------------------
Написать функцию, которая принимает значение для range и в которой работает
цикл, увеличивающий счетчик.

Если значение счетчика станет равно 7, то выполнить break.
Если цикл завершился без break, то вернуть -5

ПРИМЕРЫ
--------------------------------------------------------------------------------
lets_else(4) -> -5
lets_else(10) -> 7
"""


def lets_else(range_val: int) -> int:
    counter = -5
    for i in range(0, range_val):
        if i == 7:
            counter = 7
            break
    return counter


if __name__ == '__main__':
    assert lets_else(5) == -5
    assert lets_else(8) == 7
    print('Решено!')
